# Workstation Brewfile
# Generated from config/applications.yml.
# Do not edit manually.

# --------------------------------------------------------------------
# Formulae
# --------------------------------------------------------------------
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "tree"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "mas"
brew "python"
brew "uv"
brew "r"
brew "quarto"
brew "pandoc"
brew "hugo"
brew "imagemagick"
brew "ffmpeg"
brew "node"
brew "go"
brew "postgresql@16"
brew "mosquitto"
brew "ollama"
brew "gemini-cli"

# --------------------------------------------------------------------
# Casks
# --------------------------------------------------------------------
cask "rstudio"
cask "zotero"
cask "visual-studio-code"
cask "microsoft-office"
cask "docker"
cask "google-chrome"
cask "firefox"
cask "chatgpt"
cask "claude"
cask "rectangle"
cask "betterdisplay"

# --------------------------------------------------------------------
# Mac App Store
# --------------------------------------------------------------------
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
